#include "laba.h"
int main(){
        int LABA; // Переменная для хранения выбора пользователя
        
        printf("which laba?"); // Вывод приглашения
        scanf("%d", &LABA); // Чтение числового ввода
        switch(LABA){ // Выбор действия по введённому числу
        case 1:
                printf("Вычислить P = (A*B + C^2) / ( B*C +A )");
                laba1();
                break;
        case 2:
                printf("Для заданного значения x вычислить сумму первых элементов ряда:x^1/1-x^3/3+x^5/5-x^7/7+...");
                laba2();   
                break;
        case 3:
                printf("В потоке символов сосчитать число слов, в которых согласных букв меньше чем гласных.");
                laba3();
                break;
        case 4:
                printf("В символьной строке удалить все слова палиндромы");
                laba4();
                break;
        default:
            break;
        }
        
        return 0;
}